cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'weaveworks/tap'

brew 'nvie/tap/git-toolbelt'
# brew 'asciinema'
brew 'atool'
brew 'autoenv'
brew 'bat'
brew 'cmake'
brew 'cmatrix'
brew 'coreutils'
brew 'ctags'
brew 'docker'
brew 'docker-compose'
# brew 'docker-machine'
# brew 'weaveworks/tap/eksctl'
brew 'entr'
brew 'eza'
brew 'fasd'
brew 'fd'
brew 'ffmpeg'
brew 'fish'
brew 'fzf'
brew 'gettext'
brew 'git'
brew 'go'
brew 'gource'
brew 'grc'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'kubectl'
brew 'kubernetes-helm'
brew 'libgit2'
brew 'libpcap'
brew 'macvim'
brew 'neovim'
brew 'mas'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'protobuf'
brew 'python3'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'ranger'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'ruby-build'
brew 'rust'
brew 'spaceman-diff'
# brew 'stern'
brew 'telnet'
brew 'terminal-notifier'
brew 'tmux'
brew 'tree'
brew 'urlview'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

# cask '1password'
cask 'alacritty'
cask 'couleurs'
cask 'diffmerge'
cask 'etcher'
# cask 'google-chrome'
cask 'handbrake'
cask 'java'
cask 'karabiner-elements'
# cask 'little-snitch'
# cask 'minikube'
cask 'mounty'
# cask 'nosqlbooster-for-mongodb'
# cask 'postman'
# cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'steam'
cask 'transmission'
cask 'virtualbox'
cask 'vlc'
cask 'wireshark'
cask 'zoomus'
