cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'getantibody/tap'

brew 'ack'
brew 'ag'
brew 'atool'
brew 'autoenv'
brew 'cmake'
brew 'coreutils'
brew 'cowsay'
brew 'ctags'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'entr'
brew 'exa'
brew 'fasd'
brew 'fortune'
brew 'fzf'
brew 'antibody'
brew 'gettext'
brew 'git'
brew 'gource'
brew 'grc'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
# brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'libpcap'
brew 'lolcat'
brew 'macvim', args: ['--with-override-system-vi']
brew 'most'
brew 'node'
brew 'nvm'
brew 'openssl'
brew 'postgresql'
brew 'python3'
brew 'ranger'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'roundup'
brew 'ruby-build'
brew 'rust'
brew 'spaceman-diff'
brew 'spark'
brew 'telnet'
brew 'terminal-notifier'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'urlview'
brew 'watch'
brew 'watchman'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'

cask '1password'
cask 'caffeine'
cask 'couleurs'
# cask 'colorpicker-hex'
cask 'etcher'
# cask 'firefoxdeveloperedition'
cask 'google-chrome'
cask 'handbrake'
cask 'iterm2'
cask 'karabiner-elements'
cask 'mounty'
cask 'postman'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sourcetree'
cask 'steam'
cask 'transmission'
cask 'tunnelbear'
cask 'vlc'
cask 'zoomus'
