cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'ag'
brew 'autoenv'
brew 'coreutils'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'fzf'
brew 'getantibody/tap/antibody'
brew 'gettext'
brew 'grc'
brew 'hub'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'macvim --with-override-system-vim'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'rbenv'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'roundup'
brew 'ruby-build'
brew 'spaceman-diff'
brew 'spark'
brew 'tmux'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

cask '1password'
cask 'etcher'
cask 'firefoxdeveloperedition'
cask 'google-chrome'
cask 'handbrake'
cask 'karabiner-elements'
cask 'mounty'
cask 'slack'
cask 'steam'
cask 'transmission'
cask 'tunnelbear'
cask 'vlc'
